import { Injectable } from '@angular/core';
import {
  AnalysisData,
  IdentificationData,
  MonitoringData,
  PlanningData,
} from '../models/models';
import { DataType, RiskType } from '../models/enums';

@Injectable({
  providedIn: 'root',
})
export class DataService {
  constructor() {
    for (let item of this.analysisData) {
      item.per = Array.from({ length: 10 }, () =>
        Number(Math.random().toFixed(2))
      );
    }

    for (let item of this.monitoringData) {
      item.erper = Array.from({ length: 10 }, () =>
        Number(Math.random().toFixed(2))
      );
    }

    this.recalculate();
  }

  public recalculate(): void {
    for (let item of this.analysisData) {
      item.per = item.per.map((x) => Number(x));
      item.er = Number(
        (item.per.reduce((sum, num) => sum + num, 0) / item.per.length).toFixed(
          2
        )
      );
      item.lrer = Number(Math.random().toFixed(2));
      item.vrer = Number((item.er * item.lrer).toFixed(2));
    }

    for (let item of this.monitoringData) {
      item.erper = item.erper.map((x) => Number(x));
      item.erer = Number(
        (
          item.erper.reduce((sum, num) => sum + num, 0) / item.erper.length
        ).toFixed(2)
      );
      item.elrer = Number(Math.random().toFixed(2));
      item.evrer = Number((item.erer * item.elrer).toFixed(2));
    }
  }

  public analysisData: AnalysisData[] = [
    {
      id: 'tR1',
      name: 'затримки у постачанні обладнання, необхідного для підтримки процесу розроблення ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'tR2',
      name: 'затримки у постачанні інструментальних засобів, необхідних для підтримки процесу розроблення ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'tR3',
      name: 'небажання команди виконавців використовувати інструментальні засоби для підтримки процесу розроблення ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'tR4',
      name: 'формування запитів на більш потужні інструментальні засоби розроблення ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'tR5',
      name: 'відмова команди виконавців від CASE-засобів розроблення ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'tR6',
      name: 'неефективність програмного коду, згенерованого CASE-засобами розроблення ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'tR7',
      name: 'неможливість інтеграції CASE-засобів з іншими інструментальними засобами для підтримки процесу розроблення ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'tR8',
      name: 'недостатня продуктивність баз(и) даних для підтримки процесу розроблення ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'tR9',
      name: 'програмні компоненти, які використовують повторно в ПЗ, мають дефекти та обмежені функціональні можливості',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'tR10',
      name: 'швидкість виявлення дефектів у програмному коді є нижчою від раніше запланованих термінів',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'tR11',
      name: 'поява дефектних системних компонент, які використовують для розроблення ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'cR1',
      name: 'недо(пере)оцінювання витрат на реалізацію програмного проекту (надмірно низька вартість)',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'cR2',
      name: 'фінансові ускладнення у компанії-замовника ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'cR3',
      name: 'фінансові ускладнення у компанії-розробника ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'cR4',
      name: 'змен(збіль)шення бюджету програмного проекта з ініціативи компанії-замовника ПЗ під час його реалізації',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'cR5',
      name: 'висока вартість виконання повторних робіт, необхідних для зміни вимог до ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'cR6',
      name: 'реорганізація структурних підрозділів у компанії-замовника ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'cR7',
      name: 'реорганізація команди виконавців у компанії-розробника ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'pR1',
      name: 'зміни графіка виконання робіт з боку замовника чи розробника ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'pR2',
      name: 'порушення графіка виконання робіт з боку компанії-розробника ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'pR3',
      name: 'потреба зміни користувацьких вимог до ПЗ з боку компанії-замовника ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'pR4',
      name: 'потреба зміни функціональних вимог до ПЗ з боку компанії-розробника ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'pR5',
      name: 'потреба виконання великої кількості повторних робіт, необхідних для зміни вимог до ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'pR6',
      name: 'недо(пере)оцінювання тривалості етапів реалізації програмного проекту з боку компанії-замовника ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'pR7',
      name: 'остаточний розмір ПЗ значно перевищує (менший від) заплановані(их) його характеристики',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'pR8',
      name: 'поява на ринку аналогічного ПЗ до виходу замовленого',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'pR9',
      name: 'поява на ринку більш конкурентоздатного ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'mR1',
      name: 'низький моральний стан персоналу команди виконавців ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'mR2',
      name: 'низька взаємодія між членами команди виконавців ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'mR3',
      name: 'пасивність керівника (менеджера) програмного проекту',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'mR4',
      name: 'недостатня компетентність керівника (менеджера) програмного проекту',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'mR5',
      name: 'незадоволеність замовника результатами етапів реалізації програмного проекту',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'mR6',
      name: 'недостатня кількість фахівців у команді виконавців ПЗ з необхідним професійним рівнем',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'mR7',
      name: 'хвороба провідного виконавця в найкритичніший момент розроблення ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'mR8',
      name: 'одночасна хвороба декількох виконавців підчас розроблення ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'mR9',
      name: 'неможливість організації необхідного навчання персоналу команди виконавців ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'mR10',
      name: 'зміна пріоритетів у процесі управління програмним проектом',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'mR11',
      name: 'недо(пере)оцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'mR12',
      name: 'недостатнє (надмірне) документування результатів на етапах реалізації програмного проекту',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'mR13',
      name: 'нереалістичне прогнозування результатів на етапах реалізації програмного проекту',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
    {
      id: 'mR14',
      name: 'недостатній професійний рівень представників від компанії-замовника ПЗ',
      per: [],
      er: 0,
      lrer: 0,
      vrer: 0,
    },
  ];
  public identificationData: Record<
    DataType,
    Record<string, IdentificationData[]>
  > = {
    [DataType.Risk]: {
      [RiskType.tech]: [
        { id: 'tRS1', name: 'функціональні характеристики ПЗ', value: false },
        { id: 'tRS2', name: 'характеристики якості ПЗ', value: false },
        { id: 'tRS3', name: 'характеристики надійності ПЗ', value: false },
        { id: 'tRS4', name: 'застосовність ПЗ', value: false },
        { id: 'tRS5', name: 'часова продуктивність ПЗ', value: false },
        { id: 'tRS6', name: 'супроводжуваність ПЗ', value: false },
        {
          id: 'tRS7',
          name: 'повторне використання компонент ПЗ',
          value: false,
        },
      ],
      [RiskType.cost]: [
        {
          id: 'cRS1',
          name: 'обмеження сумарного бюджету на програмний проект',
          value: false,
        },
        {
          id: 'cRS2',
          name: 'недоступна вартість реалізації програмного проекту',
          value: false,
        },
        {
          id: 'cRS3',
          name: 'низька ступінь реалізму при оцінюванні витрат на програмний проект',
          value: false,
        },
      ],
      [RiskType.plan]: [
        {
          id: 'pRS1',
          name: 'властивості та можливості гнучкості внесення змін до планів життєвого циклу розроблення ПЗ',
          value: false,
        },
        {
          id: 'pRS2',
          name: 'можливості порушення встановлених термінів реалізації етапів життєвого циклу розроблення ПЗ',
          value: false,
        },
        {
          id: 'pRS3',
          name: 'низька ступінь реалізму при встановленні планів і етапів життєвого циклу розроблення ПЗ',
          value: false,
        },
      ],
      [RiskType.realisation]: [
        {
          id: 'mRS1',
          name: 'хибна стратегія реалізації програмного проекту',
          value: false,
        },
        {
          id: 'mRS2',
          name: 'неефективне планування проекту розроблення ПЗ',
          value: false,
        },
        {
          id: 'mRS3',
          name: 'неякісне оцінювання програмного проекту',
          value: false,
        },
        {
          id: 'mRS4',
          name: 'прогалини в документуванні етапів реалізації програмного проекту',
          value: false,
        },
        {
          id: 'mRS5',
          name: 'промахи в прогнозуванні результатів реалізації програмного проекту',
          value: false,
        },
      ],
    },
    [DataType.Event]: {
      [RiskType.tech]: [
        {
          id: 'tR1',
          name: 'затримки у постачанні обладнання, необхідного для підтримки процесу розроблення ПЗ',
          value: false,
        },
        {
          id: 'tR2',
          name: 'затримки у постачанні інструментальних засобів, необхідних для підтримки процесу розроблення ПЗ',
          value: false,
        },
        {
          id: 'tR3',
          name: 'небажання команди виконавців використовувати інструментальні засоби для підтримки процесу розроблення ПЗ',
          value: false,
        },
        {
          id: 'tR4',
          name: 'формування запитів на більш потужні інструментальні засоби розроблення ПЗ',
          value: false,
        },
        {
          id: 'tR5',
          name: 'відмова команди виконавців від CASE-засобів розроблення ПЗ',
          value: false,
        },
        {
          id: 'tR6',
          name: 'неефективність програмного коду, згенерованого CASE-засобами розроблення ПЗ',
          value: false,
        },
        {
          id: 'tR7',
          name: 'неможливість інтеграції CASE-засобів з іншими інструментальними засобами для підтримки процесу розроблення ПЗ',
          value: false,
        },
        {
          id: 'tR8',
          name: 'недостатня продуктивність баз(и) даних для підтримки процесу розроблення ПЗ',
          value: false,
        },
        {
          id: 'tR9',
          name: 'програмні компоненти, які використовують повторно в ПЗ, мають дефекти та обмежені функціональні можливості',
          value: false,
        },
        {
          id: 'tR10',
          name: 'швидкість виявлення дефектів у програмному коді є нижчою від раніше запланованих термінів',
          value: false,
        },
        {
          id: 'tR11',
          name: 'поява дефектних системних компонент, які використовують для розроблення ПЗ',
          value: false,
        },
      ],
      [RiskType.cost]: [
        {
          id: 'cR1',
          name: 'недо(пере)оцінювання витрат на реалізацію програмного проекту (надмірно низька вартість)',
          value: false,
        },
        {
          id: 'cR2',
          name: 'фінансові ускладнення у компанії-замовника ПЗ',
          value: false,
        },
        {
          id: 'cR3',
          name: 'фінансові ускладнення у компанії-розробника ПЗ',
          value: false,
        },
        {
          id: 'cR4',
          name: 'змен(збіль)шення бюджету програмного проекта з ініціативи компанії-замовника ПЗ під час його реалізації',
          value: false,
        },
        {
          id: 'cR5',
          name: 'висока вартість виконання повторних робіт, необхідних для зміни вимог до ПЗ',
          value: false,
        },
        {
          id: 'cR6',
          name: 'реорганізація структурних підрозділів у компанії-замовника ПЗ',
          value: false,
        },
        {
          id: 'cR7',
          name: 'реорганізація команди виконавців у компанії-розробника ПЗ',
          value: false,
        },
      ],
      [RiskType.plan]: [
        {
          id: 'pR1',
          name: 'зміни графіка виконання робіт з боку замовника чи розробника ПЗ',
          value: false,
        },
        {
          id: 'pR2',
          name: 'порушення графіка виконання робіт з боку компанії-розробника ПЗ',
          value: false,
        },
        {
          id: 'pR3',
          name: 'потреба зміни користувацьких вимог до ПЗ з боку компанії-замовника ПЗ',
          value: false,
        },
        {
          id: 'pR4',
          name: 'потреба зміни функціональних вимог до ПЗ з боку компанії-розробника ПЗ',
          value: false,
        },
        {
          id: 'pR5',
          name: 'потреба виконання великої кількості повторних робіт, необхідних для зміни вимог до ПЗ',
          value: false,
        },
        {
          id: 'pR6',
          name: 'недо(пере)оцінювання тривалості етапів реалізації програмного проекту з боку компанії-замовника ПЗ',
          value: false,
        },
        {
          id: 'pR7',
          name: 'остаточний розмір ПЗ значно перевищує (менший від) заплановані(их) його характеристики',
          value: false,
        },
        {
          id: 'pR8',
          name: 'поява на ринку аналогічного ПЗ до виходу замовленого',
          value: false,
        },
        {
          id: 'pR9',
          name: 'поява на ринку більш конкурентоздатного ПЗ',
          value: false,
        },
      ],
      [RiskType.realisation]: [
        {
          id: 'mR1',
          name: 'низький моральний стан персоналу команди виконавців ПЗ',
          value: false,
        },
        {
          id: 'mR2',
          name: 'низька взаємодія між членами команди виконавців ПЗ',
          value: false,
        },
        {
          id: 'mR3',
          name: 'пасивність керівника (менеджера) програмного проекту',
          value: false,
        },
        {
          id: 'mR4',
          name: 'недостатня компетентність керівника (менеджера) програмного проекту',
          value: false,
        },
        {
          id: 'mR5',
          name: 'незадоволеність замовника результатами етапів реалізації програмного проекту',
          value: false,
        },
        {
          id: 'mR6',
          name: 'недостатня кількість фахівців у команді виконавців ПЗ з необхідним професійним рівнем',
          value: false,
        },
        {
          id: 'mR7',
          name: 'хвороба провідного виконавця в найкритичніший момент розроблення ПЗ',
          value: false,
        },
        {
          id: 'mR8',
          name: 'одночасна хвороба декількох виконавців підчас розроблення ПЗ',
          value: false,
        },
        {
          id: 'mR9',
          name: 'неможливість організації необхідного навчання персоналу команди виконавців ПЗ',
          value: false,
        },
        {
          id: 'mR10',
          name: 'зміна пріоритетів у процесі управління програмним проектом',
          value: false,
        },
        {
          id: 'mR11',
          name: 'недо(пере)оцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ',
          value: false,
        },
        {
          id: 'mR12',
          name: 'недостатнє (надмірне) документування результатів на етапах реалізації програмного проекту',
          value: false,
        },
        {
          id: 'mR13',
          name: 'нереалістичне прогнозування результатів на етапах реалізації програмного проекту',
          value: false,
        },
        {
          id: 'mR14',
          name: 'недостатній професійний рівень представників від компанії-замовника ПЗ',
          value: false,
        },
      ],
    },
  };

  public planningDataEvents: string[] = [
    'попереднє навчання членів проектного колективу',
    'узгодження детального переліку вимог до ПЗ із замовником',
    'внесення узгодженого переліку вимог до ПЗ замовника в договір',
    'точне слідування вимогам замовника з узгодженого переліку вимог до ПЗ',
    'попередні дослідження ринку',
    'експертна оцінка програмного проекту досвідченим стороннім консультантом',
    'консультації досвідченого стороннього консультанта',
    'тренінг з вивчення необхідних інструментів розроблення ПЗ',
    'укладання договору страхування',
    "використання 'шаблонних' рішень з вдалих попередніх проектів при управлінні програмним проектом",
    'підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника',
    "реорганізація роботи проектного колективу так, щоб обов'язки та робота членів колективу перекривали один одного",
    'придбання (замовлення) частини компонент розроблюваного ПЗ',
    'заміна потенційно дефектних компонент розроблюваного ПЗ придбаними компонентами, які гарантують якість виконання роботи',
    'придбання більш продуктивної бази даних',
    'використання генератора програмного коду',
    'реорганізація роботи проектного колективу залежно від рівня труднощів виконання завдань та професійних рівнів розробників',
    'повторне використання придатних компонент ПЗ, які були розроблені для інших програмних проектів',
    'аналіз доцільності розроблення даного ПЗ',
  ];
  public planningData: PlanningData[] = [
    {
      id: 'tR1',
      name: 'затримки у постачанні обладнання, необхідного для підтримки процесу розроблення ПЗ',
      value: 'попереднє навчання членів проектного колективу',
    },
    {
      id: 'tR2',
      name: 'затримки у постачанні інструментальних засобів, необхідних для підтримки процесу розроблення ПЗ',
      value: '',
    },
    {
      id: 'tR3',
      name: 'небажання команди виконавців використовувати інструментальні засоби для підтримки процесу розроблення ПЗ',
      value: '',
    },
    {
      id: 'tR4',
      name: 'формування запитів на більш потужні інструментальні засоби розроблення ПЗ',
      value: '',
    },
    {
      id: 'tR5',
      name: 'відмова команди виконавців від CASE-засобів розроблення ПЗ',
      value: '',
    },
    {
      id: 'tR6',
      name: 'неефективність програмного коду, згенерованого CASE-засобами розроблення ПЗ',
      value: '',
    },
    {
      id: 'tR7',
      name: 'неможливість інтеграції CASE-засобів з іншими інструментальними засобами для підтримки процесу розроблення ПЗ',
      value: '',
    },
    {
      id: 'tR8',
      name: 'недостатня продуктивність баз(и) даних для підтримки процесу розроблення ПЗ',
      value: '',
    },
    {
      id: 'tR9',
      name: 'програмні компоненти, які використовують повторно в ПЗ, мають дефекти та обмежені функціональні можливості',
      value: '',
    },
    {
      id: 'tR10',
      name: 'швидкість виявлення дефектів у програмному коді є нижчою від раніше запланованих термінів',
      value: '',
    },
    {
      id: 'tR11',
      name: 'поява дефектних системних компонент, які використовують для розроблення ПЗ',
      value: '',
    },
    {
      id: 'cR1',
      name: 'недо(пере)оцінювання витрат на реалізацію програмного проекту (надмірно низька вартість)',
      value: '',
    },
    {
      id: 'cR2',
      name: 'фінансові ускладнення у компанії-замовника ПЗ',
      value: '',
    },
    {
      id: 'cR3',
      name: 'фінансові ускладнення у компанії-розробника ПЗ',
      value: '',
    },
    {
      id: 'cR4',
      name: 'змен(збіль)шення бюджету програмного проекта з ініціативи компанії-замовника ПЗ під час його реалізації',
      value: '',
    },
    {
      id: 'cR5',
      name: 'висока вартість виконання повторних робіт, необхідних для зміни вимог до ПЗ',
      value: '',
    },
    {
      id: 'cR6',
      name: 'реорганізація структурних підрозділів у компанії-замовника ПЗ',
      value: '',
    },
    {
      id: 'cR7',
      name: 'реорганізація команди виконавців у компанії-розробника ПЗ',
      value: '',
    },
    {
      id: 'pR1',
      name: 'зміни графіка виконання робіт з боку замовника чи розробника ПЗ',
      value: '',
    },
    {
      id: 'pR2',
      name: 'порушення графіка виконання робіт з боку компанії-розробника ПЗ',
      value: '',
    },
    {
      id: 'pR3',
      name: 'потреба зміни користувацьких вимог до ПЗ з боку компанії-замовника ПЗ',
      value: '',
    },
    {
      id: 'pR4',
      name: 'потреба зміни функціональних вимог до ПЗ з боку компанії-розробника ПЗ',
      value: '',
    },
    {
      id: 'pR5',
      name: 'потреба виконання великої кількості повторних робіт, необхідних для зміни вимог до ПЗ',
      value: '',
    },
    {
      id: 'pR6',
      name: 'недо(пере)оцінювання тривалості етапів реалізації програмного проекту з боку компанії-замовника ПЗ',
      value: '',
    },
    {
      id: 'pR7',
      name: 'остаточний розмір ПЗ значно перевищує (менший від) заплановані(их) його характеристики',
      value: '',
    },
    {
      id: 'pR8',
      name: 'поява на ринку аналогічного ПЗ до виходу замовленого',
      value: '',
    },
    {
      id: 'pR9',
      name: 'поява на ринку більш конкурентоздатного ПЗ',
      value: '',
    },
    {
      id: 'mR1',
      name: 'низький моральний стан персоналу команди виконавців ПЗ',
      value: '',
    },
    {
      id: 'mR2',
      name: 'низька взаємодія між членами команди виконавців ПЗ',
      value: '',
    },
    {
      id: 'mR3',
      name: 'пасивність керівника (менеджера) програмного проекту',
      value: '',
    },
    {
      id: 'mR4',
      name: 'недостатня компетентність керівника (менеджера) програмного проекту',
      value: '',
    },
    {
      id: 'mR5',
      name: 'незадоволеність замовника результатами етапів реалізації програмного проекту',
      value: '',
    },
    {
      id: 'mR6',
      name: 'недостатня кількість фахівців у команді виконавців ПЗ з необхідним професійним рівнем',
      value: '',
    },
    {
      id: 'mR7',
      name: 'хвороба провідного виконавця в найкритичніший момент розроблення ПЗ',
      value: '',
    },
    {
      id: 'mR8',
      name: 'одночасна хвороба декількох виконавців підчас розроблення ПЗ',
      value: '',
    },
    {
      id: 'mR9',
      name: 'неможливість організації необхідного навчання персоналу команди виконавців ПЗ',
      value: '',
    },
    {
      id: 'mR10',
      name: 'зміна пріоритетів у процесі управління програмним проектом',
      value: '',
    },
    {
      id: 'mR11',
      name: 'недо(пере)оцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ',
      value: '',
    },
    {
      id: 'mR12',
      name: 'недостатнє (надмірне) документування результатів на етапах реалізації програмного проекту',
      value: '',
    },
    {
      id: 'mR13',
      name: 'нереалістичне прогнозування результатів на етапах реалізації програмного проекту',
      value: '',
    },
    {
      id: 'mR14',
      name: 'недостатній професійний рівень представників від компанії-замовника ПЗ',
      value: '',
    },
  ];

  public monitoringData: MonitoringData[] = [
    {
      id: 'tR1',
      name: 'затримки у постачанні обладнання, необхідного для підтримки процесу розроблення ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'tR2',
      name: 'затримки у постачанні інструментальних засобів, необхідних для підтримки процесу розроблення ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'tR3',
      name: 'небажання команди виконавців використовувати інструментальні засоби для підтримки процесу розроблення ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'tR4',
      name: 'формування запитів на більш потужні інструментальні засоби розроблення ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'tR5',
      name: 'відмова команди виконавців від CASE-засобів розроблення ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'tR6',
      name: 'неефективність програмного коду, згенерованого CASE-засобами розроблення ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'tR7',
      name: 'неможливість інтеграції CASE-засобів з іншими інструментальними засобами для підтримки процесу розроблення ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'tR8',
      name: 'недостатня продуктивність баз(и) даних для підтримки процесу розроблення ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'tR9',
      name: 'програмні компоненти, які використовують повторно в ПЗ, мають дефекти та обмежені функціональні можливості',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'tR10',
      name: 'швидкість виявлення дефектів у програмному коді є нижчою від раніше запланованих термінів',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'tR11',
      name: 'поява дефектних системних компонент, які використовують для розроблення ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'cR1',
      name: 'недо(пере)оцінювання витрат на реалізацію програмного проекту (надмірно низька вартість)',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'cR2',
      name: 'фінансові ускладнення у компанії-замовника ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'cR3',
      name: 'фінансові ускладнення у компанії-розробника ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'cR4',
      name: 'змен(збіль)шення бюджету програмного проекта з ініціативи компанії-замовника ПЗ під час його реалізації',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'cR5',
      name: 'висока вартість виконання повторних робіт, необхідних для зміни вимог до ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'cR6',
      name: 'реорганізація структурних підрозділів у компанії-замовника ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'cR7',
      name: 'реорганізація команди виконавців у компанії-розробника ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'pR1',
      name: 'зміни графіка виконання робіт з боку замовника чи розробника ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'pR2',
      name: 'порушення графіка виконання робіт з боку компанії-розробника ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'pR3',
      name: 'потреба зміни користувацьких вимог до ПЗ з боку компанії-замовника ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'pR4',
      name: 'потреба зміни функціональних вимог до ПЗ з боку компанії-розробника ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'pR5',
      name: 'потреба виконання великої кількості повторних робіт, необхідних для зміни вимог до ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'pR6',
      name: 'недо(пере)оцінювання тривалості етапів реалізації програмного проекту з боку компанії-замовника ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'pR7',
      name: 'остаточний розмір ПЗ значно перевищує (менший від) заплановані(их) його характеристики',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'pR8',
      name: 'поява на ринку аналогічного ПЗ до виходу замовленого',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'pR9',
      name: 'поява на ринку більш конкурентоздатного ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'mR1',
      name: 'низький моральний стан персоналу команди виконавців ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'mR2',
      name: 'низька взаємодія між членами команди виконавців ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'mR3',
      name: 'пасивність керівника (менеджера) програмного проекту',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'mR4',
      name: 'недостатня компетентність керівника (менеджера) програмного проекту',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'mR5',
      name: 'незадоволеність замовника результатами етапів реалізації програмного проекту',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'mR6',
      name: 'недостатня кількість фахівців у команді виконавців ПЗ з необхідним професійним рівнем',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'mR7',
      name: 'хвороба провідного виконавця в найкритичніший момент розроблення ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'mR8',
      name: 'одночасна хвороба декількох виконавців підчас розроблення ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'mR9',
      name: 'неможливість організації необхідного навчання персоналу команди виконавців ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'mR10',
      name: 'зміна пріоритетів у процесі управління програмним проектом',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'mR11',
      name: 'недо(пере)оцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'mR12',
      name: 'недостатнє (надмірне) документування результатів на етапах реалізації програмного проекту',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'mR13',
      name: 'нереалістичне прогнозування результатів на етапах реалізації програмного проекту',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
    {
      id: 'mR14',
      name: 'недостатній професійний рівень представників від компанії-замовника ПЗ',
      erper: [],
      erer: 0,
      elrer: 0,
      evrer: 0,
    },
  ];
}
